feaser/openblt/stm32u5_port/Target/Source/TRICORE_TC3/flash.c
/************************************************************************************//**
* \file         Source/TRICORE_TC3/flash.c
* \brief        Bootloader flash driver source file.
* \ingroup      Target_TRICORE_TC3
* \internal
*----------------------------------------------------------------------------------------
*                          C O P Y R I G H T
*----------------------------------------------------------------------------------------
*   Copyright (c) 2022  by Feaser    http://www.feaser.com    All rights reserved
*
*----------------------------------------------------------------------------------------
*                            L I C E N S E
*----------------------------------------------------------------------------------------
* This file is part of OpenBLT. OpenBLT is free software: you can redistribute it and/or
* modify it under the terms of the GNU General Public License as published by the Free
* Software Foundation, either version 3 of the License, or (at your option) any later
* version.
*
* OpenBLT is distributed in the hope that it will be useful, but WITHOUT ANY WARRANTY;
* without even the implied warranty of MERCHANTABILITY or FITNESS FOR A PARTICULAR
* PURPOSE. See the GNU General Public License for more details.
*
* You have received a copy of the GNU General Public License along with OpenBLT. It
* should be located in ".\Doc\license.html". If not, contact Feaser to obtain a copy.
*
* \endinternal
****************************************************************************************/

/****************************************************************************************
* Include files
****************************************************************************************/
#include "boot.h"                                /* bootloader generic header          */
#include "ram_func.h"                            /* RAM function macros                */
#include "IfxDmu_reg.h"                          /* DMU register definitions           */
#include "IfxCpu.h"                              /* CPU driver                         */
#include "IfxFlash.h"                            /* Flash driver                       */


/****************************************************************************************
* Macro definitions
****************************************************************************************/
/** \brief Value for an invalid sector entry index into flashLayout[]. */
#define FLASH_INVALID_SECTOR_IDX        (0xff)
/** \brief Value for an invalid flash address. */
#define FLASH_INVALID_ADDRESS           (0xffffffff)
/** \brief Standard size of a flash block for writing. */
#define FLASH_WRITE_BLOCK_SIZE          (512)
/** \brief Minimum erase size in bytes as defined by the hardware (logical sector). */
#define FLASH_ERASE_BLOCK_SIZE          (16 * 1024)
/** \brief Total numbers of sectors in array flashLayout[]. */
#define FLASH_TOTAL_SECTORS             (sizeof(flashLayout)/sizeof(flashLayout[0]))
/** \brief End address of the bootloader programmable flash. */
#define FLASH_END_ADDRESS               (flashLayout[FLASH_TOTAL_SECTORS-1].sector_start + \
                                         flashLayout[FLASH_TOTAL_SECTORS-1].sector_size - 1)
/** \brief Offset into the user program where the checksum is located. For this target it
 *         is set to the last 32-bits of the 32 byte (0x20) section at the start of the
 *         user program, which is meant for the reset handler. The reset handler doesn't
 *         need the full 32 bytes that's reserved for it. Therefore this section can be
 *         shrunk in the user program's linker script, to only be 28 bytes (0x1C) in
 *         size. This then makes 4 bytes (32-bits) available for storing the bootloader's
 *         signature checksum placeholder.
 *         Note that this macro value can be overriden in blt_conf.h, in case you want to
 *         reserve space for the signature checksum at a different memory location. Just
 *         make sure it is located in the first FLASH_WRITE_BLOCK_SIZE bytes of the
 *         user program. When changing this value, don't forget to update the location
 *         where you reserve space for the signature checksum in the user program
 *         accordingly. Otherwise the bootloader might overwrite important program code
 *         with the calculated signature checksum value, which can result in your user
 *         program not running properly.
 */
#ifndef BOOT_FLASH_VECTOR_TABLE_CS_OFFSET
#define BOOT_FLASH_VECTOR_TABLE_CS_OFFSET    (0x1C)
#endif


/****************************************************************************************
* Plausibility checks
****************************************************************************************/
#if (BOOT_FLASH_VECTOR_TABLE_CS_OFFSET >= FLASH_WRITE_BLOCK_SIZE)
#error "BOOT_FLASH_VECTOR_TABLE_CS_OFFSET is set too high. It must be located in the first writable block."
#endif

#ifndef BOOT_FLASH_CUSTOM_LAYOUT_ENABLE
#define BOOT_FLASH_CUSTOM_LAYOUT_ENABLE (0u)
#endif


/****************************************************************************************
* Type definitions
****************************************************************************************/
/** \brief Flash sector descriptor type. */
typedef struct
{
  blt_addr   sector_start;                       /**< sector start address             */
  blt_int32u sector_size;                        /**< sector size in bytes             */
  blt_int8u  sector_num;                         /**< sector number                    */
} tFlashSector;

/** \brief    Structure type for grouping flash block information.
 *  \details  Programming is done per block of max FLASH_WRITE_BLOCK_SIZE. for this a
 *            flash block manager is implemented in this driver. this flash block manager
 *            depends on this flash block info structure. It holds the base address of
 *            the flash block and the data that should be programmed into the flash
 *            block. The .base_addr must be a multiple of FLASH_WRITE_BLOCK_SIZE.
 */
typedef struct
{
  blt_addr  base_addr;
  blt_int8u data[FLASH_WRITE_BLOCK_SIZE];
} tFlashBlockInfo;


/****************************************************************************************
* Hook functions
****************************************************************************************/
#if (BOOT_FLASH_CRYPTO_HOOKS_ENABLE > 0)
extern blt_bool FlashCryptoDecryptDataHook(blt_addr address, blt_int8u * data, 
                                           blt_int32u size);
#endif


/****************************************************************************************
* Function prototypes
****************************************************************************************/
static blt_bool  FlashInitBlock(tFlashBlockInfo *block, blt_addr address);
static tFlashBlockInfo *FlashSwitchBlock(tFlashBlockInfo *block, blt_addr base_addr);
static blt_bool  FlashAddToBlock(tFlashBlockInfo *block, blt_addr address,
                                 blt_int8u *data, blt_int32u len);
static blt_bool  FlashWriteBlock(tFlashBlockInfo *block);
static blt_bool  FlashEraseSectors(blt_int8u first_sector_idx, 
                                   blt_int8u last_sector_idx);
static blt_int8u FlashGetSectorIdx(blt_addr address);
static blt_bool  FlashEraseLogicalSectors(blt_addr log_sector_base_addr,
                                          blt_int16u num_log_sectors);
static blt_bool  FlashWritePage(blt_addr page_base_addr, blt_int8u const * page_data);

/****************************************************************************************
* Local constant declarations
****************************************************************************************/
/** \brief   If desired, it is possible to set BOOT_FLASH_CUSTOM_LAYOUT_ENABLE to > 0
 *           in blt_conf.h and then implement your own version of the flashLayout[] table
 *           in a source-file with the name flash_layout.c. This way you customize the
 *           flash memory size reserved for the bootloader, without having to modify
 *           the flashLayout[] table in this file directly. This file will then include
 *           flash_layout.c so there is no need to compile it additionally with your
 *           project.
 */
#if (BOOT_FLASH_CUSTOM_LAYOUT_ENABLE == 0)
/** \brief   Array wit the layout of the flash memory.
 *  \details Also controls what part of the flash memory is reserved for the bootloader.
 *           If the bootloader size changes, the reserved sectors for the bootloader
 *           might need adjustment to make sure the bootloader doesn't get overwritten.
 */
static const tFlashSector flashLayout[] =
{
  /* { 0xA0000000, 0x004000,   0},         flash sector   0 - reserved for bootloader  */
  /* { 0xA0004000, 0x004000,   1},         flash sector   1 - reserved for bootloader  */
  { 0xA0008000, 0x004000,   2},         /* flash sector   2 - 16kb                     */
  { 0xA000C000, 0x004000,   3},         /* flash sector   3 - 16kb                     */
  { 0xA0010000, 0x004000,   4},         /* flash sector   4 - 16kb                     */
  { 0xA0014000, 0x004000,   5},         /* flash sector   5 - 16kb                     */
  { 0xA0018000, 0x004000,   6},         /* flash sector   6 - 16kb                     */
  { 0xA001C000, 0x004000,   7},         /* flash sector   7 - 16kb                     */
  { 0xA0020000, 0x004000,   8},         /* flash sector   8 - 16kb                     */
  { 0xA0024000, 0x004000,   9},         /* flash sector   9 - 16kb                     */
  { 0xA0028000, 0x004000,  10},         /* flash sector  10 - 16kb                     */
  { 0xA002C000, 0x004000,  11},         /* flash sector  11 - 16kb                     */
  { 0xA0030000, 0x004000,  12},         /* flash sector  12 - 16kb                     */
  { 0xA0034000, 0x004000,  13},         /* flash sector  13 - 16kb                     */
  { 0xA0038000, 0x004000,  14},         /* flash sector  14 - 16kb                     */
  { 0xA003C000, 0x004000,  15},         /* flash sector  15 - 16kb                     */
  { 0xA0040000, 0x020000,  16},         /* flash sector  16 - 128kb                    */
  { 0xA0060000, 0x020000,  17},         /* flash sector  17 - 128kb                    */
  { 0xA0080000, 0x020000,  18},         /* flash sector  18 - 128kb                    */
  { 0xA00A0000, 0x020000,  19},         /* flash sector  19 - 128kb                    */
  { 0xA00C0000, 0x020000,  20},         /* flash sector  20 - 128kb                    */
  { 0xA00E0000, 0x020000,  21},         /* flash sector  21 - 128kb                    */
#if (BOOT_NVM_SIZE_KB > 1024)
  { 0xA0100000, 0x020000,  22},         /* flash sector  22 - 128kb                    */
  { 0xA0120000, 0x020000,  23},         /* flash sector  23 - 128kb                    */
  { 0xA0140000, 0x020000,  24},         /* flash sector  24 - 128kb                    */
  { 0xA0160000, 0x020000,  25},         /* flash sector  25 - 128kb                    */
  { 0xA0180000, 0x020000,  26},         /* flash sector  26 - 128kb                    */
  { 0xA01A0000, 0x020000,  27},         /* flash sector  27 - 128kb                    */
  { 0xA01C0000, 0x020000,  28},         /* flash sector  28 - 128kb                    */
  { 0xA01E0000, 0x020000,  29},         /* flash sector  29 - 128kb                    */
#endif
#if (BOOT_NVM_SIZE_KB > 2048)
  { 0xA0200000, 0x020000,  30},         /* flash sector  30 - 128kb                    */
  { 0xA0220000, 0x020000,  31},         /* flash sector  31 - 128kb                    */
  { 0xA0240000, 0x020000,  32},         /* flash sector  32 - 128kb                    */
  { 0xA0260000, 0x020000,  33},         /* flash sector  33 - 128kb                    */
  { 0xA0280000, 0x020000,  34},         /* flash sector  34 - 128kb                    */
  { 0xA02A0000, 0x020000,  35},         /* flash sector  35 - 128kb                    */
  { 0xA02C0000, 0x020000,  36},         /* flash sector  36 - 128kb                    */
  { 0xA02E0000, 0x020000,  37},         /* flash sector  37 - 128kb                    */
  { 0xA0300000, 0x020000,  38},         /* flash sector  38 - 128kb                    */
  { 0xA0320000, 0x020000,  39},         /* flash sector  39 - 128kb                    */
  { 0xA0340000, 0x020000,  40},         /* flash sector  40 - 128kb                    */
  { 0xA0360000, 0x020000,  41},         /* flash sector  41 - 128kb                    */
  { 0xA0380000, 0x020000,  42},         /* flash sector  42 - 128kb                    */
  { 0xA03A0000, 0x020000,  43},         /* flash sector  43 - 128kb                    */
  { 0xA03C0000, 0x020000,  44},         /* flash sector  44 - 128kb                    */
  { 0xA03E0000, 0x020000,  45},         /* flash sector  45 - 128kb                    */
#endif
#if (BOOT_NVM_SIZE_KB > 4096)
  { 0xA0400000, 0x020000,  46},         /* flash sector  46 - 128kb                    */
  { 0xA0420000, 0x020000,  47},         /* flash sector  47 - 128kb                    */
  { 0xA0440000, 0x020000,  48},         /* flash sector  48 - 128kb                    */
  { 0xA0460000, 0x020000,  49},         /* flash sector  49 - 128kb                    */
  { 0xA0480000, 0x020000,  50},         /* flash sector  50 - 128kb                    */
  { 0xA04A0000, 0x020000,  51},         /* flash sector  51 - 128kb                    */
  { 0xA04C0000, 0x020000,  52},         /* flash sector  52 - 128kb                    */
  { 0xA04E0000, 0x020000,  53},         /* flash sector  53 - 128kb                    */
  { 0xA0500000, 0x020000,  54},         /* flash sector  54 - 128kb                    */
  { 0xA0520000, 0x020000,  55},         /* flash sector  55 - 128kb                    */
  { 0xA0540000, 0x020000,  56},         /* flash sector  56 - 128kb                    */
  { 0xA0560000, 0x020000,  57},         /* flash sector  57 - 128kb                    */
  { 0xA0580000, 0x020000,  58},         /* flash sector  58 - 128kb                    */
  { 0xA05A0000, 0x020000,  59},         /* flash sector  59 - 128kb                    */
  { 0xA05C0000, 0x020000,  60},         /* flash sector  60 - 128kb                    */
  { 0xA05E0000, 0x020000,  61},         /* flash sector  61 - 128kb                    */
#endif
#if (BOOT_NVM_SIZE_KB > 6144)
  { 0xA0600000, 0x020000,  62},         /* flash sector  62 - 128kb                    */
  { 0xA0620000, 0x020000,  63},         /* flash sector  63 - 128kb                    */
  { 0xA0640000, 0x020000,  64},         /* flash sector  64 - 128kb                    */
  { 0xA0660000, 0x020000,  65},         /* flash sector  65 - 128kb                    */
  { 0xA0680000, 0x020000,  66},         /* flash sector  66 - 128kb                    */
  { 0xA06A0000, 0x020000,  67},         /* flash sector  67 - 128kb                    */
  { 0xA06C0000, 0x020000,  68},         /* flash sector  68 - 128kb                    */
  { 0xA06E0000, 0x020000,  69},         /* flash sector  69 - 128kb                    */
  { 0xA0700000, 0x020000,  70},         /* flash sector  70 - 128kb                    */
  { 0xA0720000, 0x020000,  71},         /* flash sector  71 - 128kb                    */
  { 0xA0740000, 0x020000,  72},         /* flash sector  72 - 128kb                    */
  { 0xA0760000, 0x020000,  73},         /* flash sector  73 - 128kb                    */
  { 0xA0780000, 0x020000,  74},         /* flash sector  74 - 128kb                    */
  { 0xA07A0000, 0x020000,  75},         /* flash sector  75 - 128kb                    */
  { 0xA07C0000, 0x020000,  76},         /* flash sector  76 - 128kb                    */
  { 0xA07E0000, 0x020000,  77},         /* flash sector  77 - 128kb                    */
  { 0xA0800000, 0x020000,  78},         /* flash sector  78 - 128kb                    */
  { 0xA0820000, 0x020000,  79},         /* flash sector  79 - 128kb                    */
  { 0xA0840000, 0x020000,  80},         /* flash sector  80 - 128kb                    */
  { 0xA0860000, 0x020000,  81},         /* flash sector  81 - 128kb                    */
  { 0xA0880000, 0x020000,  82},         /* flash sector  82 - 128kb                    */
  { 0xA08A0000, 0x020000,  83},         /* flash sector  83 - 128kb                    */
  { 0xA08C0000, 0x020000,  84},         /* flash sector  84 - 128kb                    */
  { 0xA08E0000, 0x020000,  85},         /* flash sector  85 - 128kb                    */
  { 0xA0900000, 0x020000,  86},         /* flash sector  86 - 128kb                    */
  { 0xA0920000, 0x020000,  87},         /* flash sector  87 - 128kb                    */
  { 0xA0940000, 0x020000,  88},         /* flash sector  88 - 128kb                    */
  { 0xA0960000, 0x020000,  89},         /* flash sector  89 - 128kb                    */
  { 0xA0980000, 0x020000,  90},         /* flash sector  90 - 128kb                    */
  { 0xA09A0000, 0x020000,  91},         /* flash sector  91 - 128kb                    */
  { 0xA09C0000, 0x020000,  92},         /* flash sector  92 - 128kb                    */
  { 0xA09E0000, 0x020000,  93},         /* flash sector  93 - 128kb                    */
#endif
#if (BOOT_NVM_SIZE_KB > 10240)
  { 0xA0A00000, 0x020000,  94},         /* flash sector  94 - 128kb                    */
  { 0xA0A20000, 0x020000,  95},         /* flash sector  95 - 128kb                    */
  { 0xA0A40000, 0x020000,  96},         /* flash sector  96 - 128kb                    */
  { 0xA0A60000, 0x020000,  97},         /* flash sector  97 - 128kb                    */
  { 0xA0A80000, 0x020000,  98},         /* flash sector  98 - 128kb                    */
  { 0xA0AA0000, 0x020000,  99},         /* flash sector  99 - 128kb                    */
  { 0xA0AC0000, 0x020000, 100},         /* flash sector 100 - 128kb                    */
  { 0xA0AE0000, 0x020000, 101},         /* flash sector 101 - 128kb                    */
  { 0xA0B00000, 0x020000, 102},         /* flash sector 102 - 128kb                    */
  { 0xA0B20000, 0x020000, 103},         /* flash sector 103 - 128kb                    */
  { 0xA0B40000, 0x020000, 104},         /* flash sector 104 - 128kb                    */
  { 0xA0B60000, 0x020000, 105},         /* flash sector 105 - 128kb                    */
  { 0xA0B80000, 0x020000, 106},         /* flash sector 106 - 128kb                    */
  { 0xA0BA0000, 0x020000, 107},         /* flash sector 107 - 128kb                    */
  { 0xA0BC0000, 0x020000, 108},         /* flash sector 108 - 128kb                    */
  { 0xA0BE0000, 0x020000, 109},         /* flash sector 109 - 128kb                    */
#endif
#if (BOOT_NVM_SIZE_KB > 12288)
  { 0xA0C00000, 0x020000, 110},         /* flash sector 110 - 128kb                    */
  { 0xA0C20000, 0x020000, 111},         /* flash sector 111 - 128kb                    */
  { 0xA0C40000, 0x020000, 112},         /* flash sector 112 - 128kb                    */
  { 0xA0C60000, 0x020000, 113},         /* flash sector 113 - 128kb                    */
  { 0xA0C80000, 0x020000, 114},         /* flash sector 114 - 128kb                    */
  { 0xA0CA0000, 0x020000, 115},         /* flash sector 115 - 128kb                    */
  { 0xA0CC0000, 0x020000, 116},         /* flash sector 116 - 128kb                    */
  { 0xA0CE0000, 0x020000, 117},         /* flash sector 117 - 128kb                    */
  { 0xA0D00000, 0x020000, 118},         /* flash sector 118 - 128kb                    */
  { 0xA0D20000, 0x020000, 119},         /* flash sector 119 - 128kb                    */
  { 0xA0D40000, 0x020000, 120},         /* flash sector 120 - 128kb                    */
  { 0xA0D60000, 0x020000, 121},         /* flash sector 121 - 128kb                    */
  { 0xA0D80000, 0x020000, 122},         /* flash sector 122 - 128kb                    */
  { 0xA0DA0000, 0x020000, 123},         /* flash sector 123 - 128kb                    */
  { 0xA0DC0000, 0x020000, 124},         /* flash sector 124 - 128kb                    */
  { 0xA0DE0000, 0x020000, 125},         /* flash sector 125 - 128kb                    */
  { 0xA0E00000, 0x020000, 126},         /* flash sector 126 - 128kb                    */
  { 0xA0E20000, 0x020000, 127},         /* flash sector 127 - 128kb                    */
  { 0xA0E40000, 0x020000, 128},         /* flash sector 128 - 128kb                    */
  { 0xA0E60000, 0x020000, 129},         /* flash sector 129 - 128kb                    */
  { 0xA0E80000, 0x020000, 130},         /* flash sector 130 - 128kb                    */
  { 0xA0EA0000, 0x020000, 131},         /* flash sector 131 - 128kb                    */
  { 0xA0EC0000, 0x020000, 132},         /* flash sector 132 - 128kb                    */
  { 0xA0EE0000, 0x020000, 133},         /* flash sector 133 - 128kb                    */
  { 0xA0F00000, 0x020000, 134},         /* flash sector 134 - 128kb                    */
  { 0xA0F20000, 0x020000, 135},         /* flash sector 135 - 128kb                    */
  { 0xA0F40000, 0x020000, 136},         /* flash sector 136 - 128kb                    */
  { 0xA0F60000, 0x020000, 137},         /* flash sector 137 - 128kb                    */
  { 0xA0F80000, 0x020000, 138},         /* flash sector 138 - 128kb                    */
  { 0xA0FA0000, 0x020000, 139},         /* flash sector 139 - 128kb                    */
  { 0xA0FC0000, 0x020000, 140},         /* flash sector 140 - 128kb                    */
  { 0xA0FE0000, 0x020000, 141},         /* flash sector 141 - 128kb                    */
#endif
#if (BOOT_NVM_SIZE_KB > 16384)
#error "BOOT_NVM_SIZE_KB > 16384 is currently not supported."
#endif
};
#else
#include "flash_layout.c"
#endif /* BOOT_FLASH_CUSTOM_LAYOUT_ENABLE == 0 */


/****************************************************************************************
* Local data declarations
****************************************************************************************/
/** \brief   Local variable with information about the flash block that is currently
 *           being operated on.
 *  \details The smallest amount of flash that can be programmed is
 *           FLASH_WRITE_BLOCK_SIZE. A flash block manager is implemented in this driver
 *           and stores info in this variable. Whenever new data should be flashed, it
 *           is first added to a RAM buffer, which is part of this variable. Whenever
 *           the RAM buffer, which has the size of a flash block, is full or  data needs
 *           to be written to a different block, the contents of the RAM buffer are
 *           programmed to flash. The flash block manager requires some software
 *           overhead, yet results is faster flash programming because data is first
 *           harvested, ideally until there is enough to program an entire flash block,
 *           before the flash device is actually operated on.
 */
static tFlashBlockInfo blockInfo;

