feaser/openblt/stm32u5_port/Target/Source/TRICORE_TC3/flash.c
  /* give the result back to the caller */
  return result;
} /*** end of FlashAddToBlock ***/


/************************************************************************************//**
** \brief     Programs FLASH_WRITE_BLOCK_SIZE bytes to flash from the block->data
**            array.
** \param     block   Pointer to flash block info structure to operate on.
** \return    BLT_TRUE if successful, BLT_FALSE otherwise.
**
****************************************************************************************/
static blt_bool FlashWriteBlock(tFlashBlockInfo *block)
{
  blt_bool           result = BLT_TRUE;
  blt_addr           page_addr;
  blt_int8u        * page_data;
  blt_int32u         page_cnt;

  /* configuration check. */
  ASSERT_CT((FLASH_WRITE_BLOCK_SIZE % IFXFLASH_PFLASH_PAGE_LENGTH) == 0);

  /* check that the address is actually within flash */
  if (FlashGetSectorIdx(block->base_addr) == FLASH_INVALID_SECTOR_IDX)
  {
    result = BLT_FALSE;
  }

#if (BOOT_FLASH_CRYPTO_HOOKS_ENABLE > 0)
  #if (BOOT_NVM_CHECKSUM_HOOKS_ENABLE == 0)
  /* note that the bootblock is already decrypted in FlashWriteChecksum(), if the
   * internal checksum mechanism is used. Therefore don't decrypt it again.
   */
  if (block != &bootBlockInfo)
  #endif
  {
    /* perform decryption of the program data before writing it to flash memory. */
    if (FlashCryptoDecryptDataHook(block->base_addr, block->data, 
                                   FLASH_WRITE_BLOCK_SIZE) == BLT_FALSE)
    {
      result = BLT_FALSE;
    }
  }
#endif

  /* only continue if all is okay so far */
  if (result == BLT_TRUE)
  {
    /* program all pages in the block one by one. */
    for (page_cnt=0; page_cnt < (FLASH_WRITE_BLOCK_SIZE/IFXFLASH_PFLASH_PAGE_LENGTH); page_cnt++)
    {
      /* determine the page's base address and data pointer. */
      page_addr = block->base_addr + (page_cnt * IFXFLASH_PFLASH_PAGE_LENGTH);
      page_data = &block->data[page_cnt * IFXFLASH_PFLASH_PAGE_LENGTH];
      /* keep the watchdog happy */
      CopService();
      /* program the data to the page. */
      if (FlashWritePage(page_addr, page_data) == BLT_FALSE)
      {
        /* flag the error and stop the loop. */
        result = BLT_FALSE;
        break;
      }
    }
  }

  /* Give the result back to the caller. */
  return result;
} /*** end of FlashWriteBlock ***/


/************************************************************************************//**
** \brief     Erases the flash sectors from indices first_sector_idx up until
**            last_sector_idx into the flashLayout[] array.
** \param     first_sector_idx First flash sector number index into flashLayout[].
** \param     last_sector_idx  Last flash sector number index into flashLayout[].
** \return    BLT_TRUE if successful, BLT_FALSE otherwise.
**
****************************************************************************************/
static blt_bool FlashEraseSectors(blt_int8u first_sector_idx, blt_int8u last_sector_idx)
{
  blt_bool   result = BLT_TRUE;
  blt_int8u  sectorIdx;
  blt_addr   sectorBaseAddr;
  blt_int32u sectorSize;
  blt_addr   logSectorBaseAddr;
  blt_int16u numOfLogSectorsToErase;
  blt_bool   logSectorEraseResult;

  /* validate the sector numbers */
  if (first_sector_idx > last_sector_idx)
  {
    result = BLT_FALSE;
  }

  /* only continue if all is okay so far */
  if (result == BLT_TRUE)
  {
    if (last_sector_idx > (FLASH_TOTAL_SECTORS-1))
    {
      result = BLT_FALSE;
    }
  }

  /* only continue if all is okay so far */
  if (result == BLT_TRUE)
  {
    /* erase the sectors one by one */
    for (sectorIdx = first_sector_idx; sectorIdx <= last_sector_idx; sectorIdx++)
    {
      /* get information about the sector */
      sectorBaseAddr = flashLayout[sectorIdx].sector_start;
      sectorSize = flashLayout[sectorIdx].sector_size;
      /* validate the sector information */
      if ( (sectorBaseAddr == FLASH_INVALID_ADDRESS) || (sectorSize == 0) )
      {
        /* invalid sector information. flag error and abort erase operation */
        result = BLT_FALSE;
        break;
      }
      
      /* erase sector could comprise of multiple logical sectors. calculate how many.  */
      numOfLogSectorsToErase = (blt_int16u)(sectorSize / FLASH_ERASE_BLOCK_SIZE);
      if ((sectorSize % FLASH_ERASE_BLOCK_SIZE) > 0)
      {
        numOfLogSectorsToErase++;
      }
      /* sanity check. the flash command processor on the microcontroler can handle
       * erasing multiple sectors, but only if it span <= 512 kb. If this assertion
       * triggers, then there is an entry in the flashLayout[] table that has a sector
       * size of more than 512kb. correct the entries and then try again.
       */
      ASSERT_RT(numOfLogSectorsToErase <= ((512UL*1024UL)/FLASH_ERASE_BLOCK_SIZE));
      /* service the watchdog */
      CopService();
      /* set the base address of the first logical sector to erase. */
      logSectorBaseAddr = sectorBaseAddr;
      /* erase the logical sectors. */
      logSectorEraseResult = FlashEraseLogicalSectors(logSectorBaseAddr, numOfLogSectorsToErase);
      /* was an error dectected during the sector erase? */
      if(logSectorEraseResult == BLT_FALSE)
      {
        /* could not perform erase operation */
        result = BLT_FALSE;
        /* error detected so don't bother continuing with the loop */
        break;
      }
    }
  }

  /* give the result back to the caller */
  return result;
} /*** end of FlashEraseSectors ***/


/************************************************************************************//**
** \brief     Erases the logical sectors starting at the specified base address.
** \attention This function must run from program scratch RAM and not from flash. As
**            such, it should also not call any functions that are not in RAM. Calling
**            inline functions is okay though.
** \param     log_sector_base_addr Base address of the first logical sector.
** \param     num_log_sectors Total number of logical sectors to erase.
** \return    BLT_TRUE if the logical sectors were successfully erased, BLT_FALSE
**            otherwise.
**
****************************************************************************************/
BLT_RAM_FUNC_BEGIN
static blt_bool FlashEraseLogicalSectors(blt_addr log_sector_base_addr,
                                         blt_int16u num_log_sectors)
{
  blt_bool   result = BLT_TRUE;
  blt_int16u endInitSafetyPassword;
  blt_bool   alreadyErased = BLT_FALSE;

  /* only continue if the specified address is properly aligned to a logical sector. */
  if ((log_sector_base_addr % FLASH_ERASE_BLOCK_SIZE) != 0)
  {
    return BLT_FALSE;
  }

