feaser/openblt/stm32u5_port/Target/Source/TRICORE_TC3/flash.c
  /* first clear all error and status flags. */
  IfxFlash_clearStatus(0);
  /* perform an erase verify of the sectors. they might already be erased. */
  IfxFlash_eraseVerifyMultipleSectors(log_sector_base_addr, num_log_sectors);
  /* wait until the command completed. */
  IfxFlash_waitUnbusyAll();
  /* only evaluate the result if no sequence error was detected. */
  if (MODULE_DMU.HF_ERRSR.B.SQER == 0)
  {
    /* if the sector is already erased, no verification error is detected. */
    if (MODULE_DMU.HF_ERRSR.B.EVER == 0)
    {
      alreadyErased = BLT_TRUE;
    }
  }

  /* Only continue if the sectors are not in the erase state. */
  if (alreadyErased == BLT_FALSE)
  {
    /* clear all error and status flags. */
    IfxFlash_clearStatus(0);
    /* get the current password of the Safety WatchDog module and disable EndInit
     * protection.
     */
    endInitSafetyPassword = IfxScuWdt_getSafetyWatchdogPasswordInline();
    IfxScuWdt_clearSafetyEndinitInline(endInitSafetyPassword);
    /* erase the sectors. */
    IfxFlash_eraseMultipleSectors(log_sector_base_addr, num_log_sectors);
    /* re-enable EndInit protection. */
    IfxScuWdt_setSafetyEndinitInline(endInitSafetyPassword);
    /* wait until the sectors are erased. */
    IfxFlash_waitUnbusyAll();

    /* clear all error and status flags. */
    IfxFlash_clearStatus(0);
    /* perform an erase verify of the sectors to verify success. */
    IfxFlash_eraseVerifyMultipleSectors(log_sector_base_addr, num_log_sectors);
    /* wait until the command completed. */
    IfxFlash_waitUnbusyAll();
    /* no sequency error should be detected and the sectors should be in the erased
     * state.
     */
    if ( (MODULE_DMU.HF_ERRSR.B.SQER != 0) || (MODULE_DMU.HF_ERRSR.B.EVER != 0) )
    {
      /* erase operation was not successful. update the result accordingly. */
      result = BLT_FALSE;
    }
  }

  /* give the result back to the caller. */
  return result;
} /*** end of FlashEraseLogicalSector ***/
BLT_RAM_FUNC_END


/************************************************************************************//**
** \brief     Programs data to a flash page starting at the specified base address.
** \attention This function must run from program scratch RAM and not from flash. As
**            such, it should also not call any functions that are not in RAM. Calling
**            inline functions is okay though.
** \param     page_base_addr Base address of the flash page.
** \param     page_data Pointer to the byte array with data to program to the flash page.
** \return    BLT_TRUE if the page was successfully programmed, BLT_FALSE otherwise.
**
****************************************************************************************/
BLT_RAM_FUNC_BEGIN
static blt_bool FlashWritePage(blt_addr page_base_addr, blt_int8u const * page_data)
{
  blt_bool           result = BLT_TRUE;
  blt_int16u         endInitSafetyPassword;
  blt_int32u         dword_cnt;
  blt_int32u const * page_data_ptr;
  blt_int32u const * word_flash_ptr;
  blt_int32u const * word_data_ptr;
  blt_int32u         word_cnt;

  /* only continue if the specified address is properly aligned to a flash page. */
  if ((page_base_addr % IFXFLASH_PFLASH_PAGE_LENGTH) != 0)
  {
    return BLT_FALSE;
  }

  /* get the current password of the Safety WatchDog module. */
  endInitSafetyPassword = IfxScuWdt_getSafetyWatchdogPasswordInline();
  /* initialize the data pointer to point to the first word for the page. */
  page_data_ptr = (blt_int32u const *)page_data;
  /* clear all error and status flags. */
  IfxFlash_clearStatus(0);
  /* enter page mode which is needed before loading data into the assembly buffer and
   * then writing the data to the page.
   */
  IfxFlash_enterPageMode(page_base_addr);
  /* wait until the command completed. */
  IfxFlash_waitUnbusyAll();
  /* write the data into the assembly buffer, two words at a time. */
  for (dword_cnt=0; dword_cnt<(IFXFLASH_PFLASH_PAGE_LENGTH/(sizeof(blt_int32u) * 2)); dword_cnt++)
  {
    /* write to the assembly buffer. note that flash command processor automatically
     * increments the write pointer for the next call. this means that there is no need
     * to increment the page's base address.
     */
    IfxFlash_loadPage2X32(page_base_addr, page_data_ptr[0], page_data_ptr[1]);
    /* update the page data pointer to point to the next two words. */
    page_data_ptr++;
    page_data_ptr++;
  }
  /* disable EndInit protection. */
  IfxScuWdt_clearSafetyEndinitInline(endInitSafetyPassword);
  /* write the page. note that this automatically leaves page mode. */
  IfxFlash_writePage(page_base_addr);
  /* re-enable EndInit protection. */
  IfxScuWdt_setSafetyEndinitInline(endInitSafetyPassword);
  /* wait until the page is programmed. */
  IfxFlash_waitUnbusyAll();
  /* no sequency or programming error should have been detected. */
  if ( (MODULE_DMU.HF_ERRSR.B.SQER != 0) || (MODULE_DMU.HF_ERRSR.B.PVER != 0) )
  {
    /* write operation was not successful. update the result accordingly. */
    result = BLT_FALSE;
  }

  /* page programming completed without an error? */
  if (result == BLT_TRUE)
  {
    /* initialize flash and data pointers to the start of the page. */
    word_flash_ptr = (blt_int32u const *)page_base_addr;
    word_data_ptr  = (blt_int32u const *)page_data;
    /* verify that the written data is actually there, one word at a time. */
    for (word_cnt=0; word_cnt<(IFXFLASH_PFLASH_PAGE_LENGTH/sizeof(blt_int32u)); word_cnt++)
    {
      /* does the data written to flash have the expected value? */
      if (*word_flash_ptr != *word_data_ptr)
      {
        /* flag the error and stop the verification loop. */
        result = BLT_FALSE;
        break;
      }
      /* update pointers for the next word to check. */
      word_flash_ptr++;
      word_data_ptr++;
    }
  }

  /* give the result back to the caller. */
  return result;
} /*** end of FlashWritePage ***/
BLT_RAM_FUNC_END


/************************************************************************************//**
** \brief     Determines the index into the flashLayout[] array of the flash sector that
**            the specified address is in.
** \param     address Address in the flash sector.
** \return    Flash sector index in flashLayout[] or FLASH_INVALID_SECTOR_IDX.
**
****************************************************************************************/
static blt_int8u FlashGetSectorIdx(blt_addr address)
{
  blt_int8u result = FLASH_INVALID_SECTOR_IDX;
  blt_int8u sectorIdx;

  /* search through the sectors to find the right one */
  for (sectorIdx = 0; sectorIdx < FLASH_TOTAL_SECTORS; sectorIdx++)
  {
    /* keep the watchdog happy */
    CopService();
    /* is the address in this sector? */
    if ((address >= flashLayout[sectorIdx].sector_start) && \
        (address < (flashLayout[sectorIdx].sector_start + \
                    flashLayout[sectorIdx].sector_size)))
    {
      /* update the result value and stop looping */
      result = sectorIdx;
      break;
    }
  }

  /* give the result back to the caller */
  return result;
} /*** end of FlashGetSectorIdx ***/


/*********************************** end of flash.c ************************************/
